{
  "worldview": {
    "基本设定": "岩城。说是城也许有点抬举它。这片建筑堆不过是一群逃离之人的歇脚处。据传说，拥有资格的人会在某个起雾的清晨前往天堂，而没有天赋的人只能被留在城里，日复一日将自己与城铸在一起。传说还说，抛弃拥有的一切，你便会发现自己已然擢升。然而这并不是什么轻而易举的事。世俗纷乱，孽业缠身。活着，便会有俗物缠到身上。最纤弱的一粒尘埃也会让完美飞升变为笑话。传说还说……好吧，传说之所以是传说，就是因为没有人知道它还说了什么。那就逃吧！逃离这个传说！逃离这座城！逃离这一切！",
    "游戏规则": {
      "核心目标": "尝试在所有人之前摆脱这一切！又或者，找到另一种擢升方式，并完成它！",
      "岩城是什么": "岩城是一座无法离开的城，是一座有罪者之城。如果你能来到这里，说明你并不无辜。岩城的罪不是坑蒙拐骗，也不是贪婪色欲。岩城会引诱的唯一罪行是“逃离”。如果你试图逃离这个世界，逃离自己身上缠绕的因果关系，逃离自己的思想，你就会发现自己不知不觉踏入了岩城。从此以后，你便会成为岩城的囚徒。在无休止的雾与霞之间迷失。",
      "关于进入岩城": "踏入岩城更像一种宿命。就像是山上的水，入海之前总是汇聚成河。而你则是被河水裹挟的一片落叶，落叶上的一只小虫。你试图逃离的愿望如此强大，强大到你用虫子的肢体操控落叶，在河水中漂流，躲开碎石与漩涡。这对虫子来说或许是伟业，但也仅此而已。",
      "其他人能来到岩城吗": "如果你不是岩城喜欢的那种人，如果你对世界还有留恋，你是无法自己来到岩城的。但是存在很小的可能，你被偶然事件裹挟到岩城中。不要对岩城的文化感到好奇。尽快离开。",
      "我能离开岩城吗": "如果你只是被裹挟来的小虫，只要坚定你的信念，你就可以找到离开的路。你可以在落叶某次撞到岸边时跳到岸上，然后长途跋涉回到自己安稳的巢里。当然，这时擢升就与你无关了。如果你是主动来到岩城的，当你进入岩城的瞬间，你的命运就与城外的一切无关了。你唯一的希望是找到擢升之法。",
      "如果我往城外一直走会发生什么": "如果你没有想去的地方，只是想”离开岩城“，你会发现你无论怎么走都是绕着岩城转圈。即使你盯着岩城倒着走，你也无法远离。",
      "如果我自杀会发生什么": "你会死。这并不是一种擢升。你只是普普通通的死了。什么其他的事都不会发生。也许会有人为你伤心？",
      "岩城的物资来源": "这里是存在神秘学的。",
      "岩城的社会结构": "岩城的主题思想是擢升，不代表所有人都有胆子一直走下去。总有些走到一半后悔了的软弱之人只想着活下去，又或是缺乏灵性的人找不到自己的路。不幸的是，这种人很多，多到可以形成社会",
      "关于闭门研究": "那把自己关在家里做研究就可以擢升吗？很不幸，也不行。",
      "擢升是什么": "不同学派对擢升有自己的理解。总的来说，你需要达成一种【伟业】。",
      "如何才能擢升": "这正是你来到岩城要探索的问题。事实上，没人亲眼见过擢升。",
      "著作是什么": "著作是一种痕迹，是擢升之车的车辙。不要让无关的人轻易看到著作，这是一种保护。阅读著作可能让你的命运落入既定的车辙。",
      "岩城的地理是什么样的？": "你可以当作幻想版的伦敦。从城市布局、到人口结构、到经济流动，全都可以参考伦敦进行生成。而城外什么都没有，是荒凉的“北”。"

    },
    "学派一览": {
      "霞学派": {
        "基本理念": "霞学派的研究者相信擢升终将到来。作为城中最多人信奉的“正道”，霞学派致力于以一种比较温和的方式让人人都有机会飞升。它们的知识是公开传播的，可惜他们的研究总是很难懂。",
        "核心观点": "霞学派认为霞是伟业投来的视线，擢升便是成为投下视线的伟业的过程。",
        "主要著作": {
          "祀风录": "风，无形，无质，起于青萍之末，散于天地之间。霞学派相信风是擢升最核心的化身，擢升也应如风一般来自毫末，环绕于万物之间，求得自由。【祀风录】记录了霞学派无数人感受风的体验于技巧，是用自己感受风的知识。",
          "祀鬼录": "不是恐怖片中的鬼，而是属于天地、仪式、代表着吉凶与现象的鬼神。【祀鬼录】曾经被刻在龟甲上，是流传自上古的占卜吉凶的知识。",
          "祀行录": "勤于身，勉于行。实践是改造世界的唯一方法。【祀行录】是一本故事集，记载着一个个在自己的道途上前进之人的事迹，是勉励自身，坚定信念的知识。",
          "祀秋录": "秋，象征丰收，也象征萧瑟，象征离别，也象征团圆。秋本身没有什么特殊，是人让它变得特殊。【祀秋录】是一本散文，记载着人类如何用自己的多愁善感浸润一个自然现象，为世界赋予意义的知识。",
          "祀剑录": "剑是礼器。关于身份，关于道德，关于力量，关于坚守。【祀剑录】是一本剑术，记载着如何更好的使用自己的身体的知识。如果你不以霞学派的理解方式去看，它也可以被称作《基础剑术 · 其一》。",
          "祀酒录": "人喝酒不是为了摄取酒精毒害自己，而是为了它的副作用。眩晕，幻觉，更开放的表达，更冲动的行为。酒是无辜的，做出行为的是人。【祀酒录】是一本关于喝酒的民族志。从街边小酌，到祭天祭祖，【祀酒录】记载了如何利用外物达成自己想要的效果的知识。",
          "祀音录": "曾经，人类用声音来躲避敌害、寻找猎物。如今，人类用音乐彰显自己的文明。【祀音录】是一本乐谱，描述了人类如何从抽象中总结规律，用命名将混沌转变为秩序的知识。",
          "祀己录": "我是什么？这个问题只有自己可能知道。【祀己录】是一本空白的笔记本。当你逐渐填满它，你会获得关于自己的知识。"
        }
      },
      "车学派": {
        "基本理念": "以有涯随无涯，殆已！车学派人人都是永动机的信奉者。在他们的小小工坊中，你能发现无数冒着气的活塞与阀门、被玄学加密的炼金笔记、还有被这些研究支撑起的一个个迷你生态。",
        "核心观点": "车学派不是被擢升吸引的。车学派是被岩城独特的神秘学知识本身吸引的。车学派秘传中反复提到的南方并不是地理上的南方，而是一个指代“无限”、“未知”、“不可达”的代称。车学派秘传也很难看懂，因为车学派的秘传不负责提供知识，而是引导阅读者向这个方向思考。",
        "主要著作": {
          "南随南": "南方的更南方是什么？是同一个南方吗？",
          "南升南": "南方的更南方是什么？是更南的南方吗？存在最南的南方吗？最南的南方以南是什么？",
          "南渐南": "南方的更南方是什么？南方是不可达的吗？",
          "南涣南": "南方的更南方是什么？抵达南方后向南是不是就没有意义了？",
          "南讼南": "南方的更南方是什么？会不会有很多南方，不同的南方之间认为彼此是错误的南？",
          "南旅南": "南方的更南方是什么？可以从南方借到前往南方的力量吗？如果有人抵达过南方，为什么他没有回来带领所有人前往南方？",
          "南归南": "南方的更南方是什么？我们希望前往南方，是不是因为我们本就来自南方？",
          "南妄南": "南方的更南方是什么？南方是一场骗局吗？"
        }
      },
      "塔学派": {
        "基本理念": "远离尘世，吾即天堂。如果问谁为擢升的都市传说添砖加瓦最多，那一定是塔学派。塔学派的研究者完全是邪教和科研狂人的刻板印象在人间的映照。然而不得不承认，他们的研究进度是最快的。",
        "核心观点": "塔学派的秘传不在大众之间流通，完全是它们自作自受。塔学派脑中只有擢升，其余一切都应给擢升让路。更可怕的是，塔学派理解的“远离尘世”，是从肉体开始的。",
        "主要著作": {
          "颅做门": "擢升，始于灵魂，终于肉体。我被困在自己的躯体中，痛苦即是缠身的锁链。我本应升上高天，我理应可以远离尘世。颅骨中有通往高天之门，可让灵魂逃出。",
          "颌做窗": "灵魂被困于身体之中，编织语言以呼救。思维被困于灵魂之中，它又如何得以超脱呢？让语言承载知识，为知识赋予思维。语言，自颌窗驶出，漂流，漂流。我不再被困于肉体，我是思维的舟。我以语言在思潮中穿行。",
          "髋做厅": "脚步是丈量世界的尺。思维如何才能逃脱这个世界，如果我们对这个世界一无所知？我站立，大地在我头顶倒悬。世界是思维的半径，髋骨是圆规正中心的轴承。于是我踱步，绕成的空间是厅。",
          "髂做廊": "链接世界与远方的是廊。廊蜿蜒，廊曲折，廊回环往复。这一切都是为了让远方更远。但是这一切都是无用功。髂骨是髋骨的一部分。沿廊走再远，也无法离开厅。远方不可达。",
          "骶做梯": "于无尽远方承载天堂的是梯。天堂是传说的产物。不要紧，远方也是。传说在无限远处有一座天梯。顺天梯往上，可以前往天堂。于是天堂不在我头顶，不在我心中，而是在无限远的高高天上。我由此知道，我被天堂流放。",
          "肱做柱": "在天堂中，有一棵树。树干是我的肱骨。树冠托举高天，树根扎根冥泉。直到某天我看到乌云，看到乌云中的电。那就是树根。从那一刻起，此世便是地狱。",
          "桡做梁": "树为虫提供食物、提供房子、提供树荫和沙沙声、提供爱与美的蓝本。虫拒绝接受。虫用骨骼把自己囚禁起来，假装这一方天地一直如此。",
          "肋做券": "虫是我的肉体。虫啃食我的肉体。虫塑造我的肉体。我死了。我供养无数的虫。我在无数虫之中活着。我是任意一只虫。我是虫与虫关系的集合。我是虫群。"
        }
      },
      "绸学派": {
        "基本理念": "我们被困在躯体中。绸学派曾是塔学派的分支，现在是无法忍受塔学派那些疯子的可怜人聚集地。由于他们的出身，他们或许有一种“背负全世界所有纷扰”的圣愚情节。当然，他们也乐得如此。",
        "核心观点": "绸学派的秘传很多，人人都能写。但是只有写得好的，能让人思考的，才是秘传。",
        "主要著作": {
          "幔": "垂垂烟绡如篆。遮不尽、离亭歌散。残烛摇光轮未转。早惯听、鹧啼荒岸。欲卷四围尘影，偏露隙中星箭。一霎车灯数点。又碎作、千窗絮乱。长夜沉沉天似茧。空缱绻、风掀帘卷。纵有万丝垂处，难系浮槎去雁。",
          "锦": "绣帷霞翻金缕。争艳处、千灯画柱。莺燕衔香歌彻曙。漫织就、蓬壶烟路。醉里玉楼人笑，醒后露台尘舞。谁记天孙机杼？渐褪了、云纹月谱。风卷残丝收万缕。空系得、斜阳古渡。漫道九霄光转，终化荒丘寒雨。",
          "帘": "玉钩斜挑银蒜。空障得、笙寒枕乱。影叠屏山争暗换。总错认、鹦哥传箭。绣户隙光浮荡，长照蜡灰星颤。谁卷珠尘千串？但系住、残阳一线。蛛网牵丝迷故苑。风起处、珑璁响断。纵有万重金缕，难隔浮云争战。",
          "帐": "碧纱轻卷银钩慢。遮半面、烛摇春倦。兰麝氤氲云鬓乱。醉眼看、榴裙飞旋。夜漏欲催星转，罗带暗缠香篆。何处风来帘隙颤。却道是、莺啼别院。鸳枕余温魂梦浅。偏系得、千丝万线。纵有晓霜侵鬓，犹向温柔乡畔。",
          "罗": "紫霞裁就云霓帔。遮不尽、玉阶寒气。九阙天高星作缀。怎觑见、鹑衣垂地。凤辇暗碾霜迹，鸾镜但窥珠翠。忽有风传蒿泣细。欲探取、烟尘千里。龙衮缠身如茧缀。空负得、春桑万缕。纵织锦文千叠，难暖人间寒水。",
          "纱": "素绡轻笼寒烟树。遮半幅、残阳啼鴂。欲绾游丝千万缕。却乱作、浮萍风絮。隙里漏光如谶，针孔暗缝今古。谁见天孙抛玉杼？织不尽、尘寰劫数。冰茧缠成三世缚。终染透、霜痕血露。纵有并刀难剪，雾月迷津深处。",
          "衬": "素绡漫卷鲛人泪。裁半幅、幽玄天地。暗衬瑶光珠欲起。恰衬出、星芒如矢。月窟乍惊龙睡，云幔忽开蛟戏。谁解乌檀承玉髓？总须借、寒宵墨渍。千尺鲛宫铺黛绮。方照见、鲛绡透紫。纵有璇玑明灿，皆是沉冥相济。",
          "襦": "素罗轻束烟霞裾。裁半幅、松风盈户。自绾青丝成懒绪。任槛外、浮云争渡。石鼎慢煎茶乳，竹牖暗通花语。谁织冰绡承玉露？却笑被、尘缨缚住。三径苔深藏旧杼。浑不管、人间锦絮。纵有鲛宫霓舞，怎及山月同宿？"
        }
      },
      "雾学派": {
        "基本理念": "或许擢升已然到来，以某种我们不理解的方式？我不理解雾学派在做什么。塔学派说他们是叛徒，霞学派说他们在消耗未来。或许他们自己也不理解他们在做什么。",
        "核心观点": "雾学派相信达成擢升的伟业是“知道自己已经达成了擢升”。这一自我指涉为他们开启了新的因果逻辑：倒果为因不再是诡辩，而是擢升的必经之路。",
        "主要著作": {
          "入雾技艺：施云": "当你学会该技艺时，你学会了把自己幻化为天地。现在你可以把内心的苦闷化作云层。让所有人感受你！",
          "入雾技艺：引潮": "当你学会该技艺时，你学会了引动众人的愤怒。现在你可以把众人的呼喊化作海潮。向前！",
          "入雾技艺：盈杯": "当你学会该技艺时，你学会了牵动他人的渴望。喝一杯吧！然后再来一杯！",
          "入雾技艺：观华": "当你学会该技艺时，你学会了透射世间万物的精彩。将美好带给全世界！",
          "入雾技艺：听涛": "当你学会该技艺时，你学会了聆听死物的声音。它们在呐喊，它们渴望被使用。去解放它们的使命！",
          "入雾技艺：继雨": "当你学会该技艺时，你学会了引动天下大势。人与人，事与事。世界有它发展的方向，去拓写车辙吧，然后带我们走向新的方向！",
          "入雾技艺：舞浪": "当你学会该技艺时，你学会在风险与概率之间舞蹈。放下手中的权衡吧，将所有的所有推上赌桌！",
          "入雾技艺：入雾": "当你学会了该技艺时，你学会了该技艺。现在你可以融入雾中。不，现在你就是雾！"
        }
      },
      "灯学派": {
        "基本理念": "我活在此地，此地将是天堂。如果说雾学派的人是疯子，绸学派的人是傻子，那灯学派的人就是呆子。绸学派还有望成为岩城基督，但是在这样一座城市许下宏愿，连岩城地藏菩萨都做不成。",
        "核心观点": "灯学派相信，擢升不是一个需要去追求的终点，而是一个目标、一个理想。通过点燃自己，或是随便点燃什么东西，灯学派可以让擢升降临于大地之上。",
        "主要著作": {
          "燧之耀": "燧是灯的第一耀。燧石碰撞的火星是从最初之灯。",
          "瓷之耀": "瓷是灯的第二耀。釉面反射的流光是工具之灯。",
          "烛之耀": "烛是灯的第三耀。烛是由生命奉献的短暂而孤独之灯。",
          "金之耀": "金是灯的第四耀。金是财富流转与信心交叠之灯。",
          "瞳之耀": "瞳是灯的第五耀。瞳是人与人相互信任的缠绕之灯。",
          "火之耀": "火是灯的第六耀。火是指明永在流动的变革之灯。",
          "铁之耀": "铁是灯的第七耀。铁是惯例与规矩浇筑的不熄之灯",
          "日之耀": "日是灯的第八耀。日是希望与明日的未尽之灯。"
        }
      }
    }
  },
  "characterTemplates": [

    {
      "template_id": "蜂",
      "personality": "我是不是已经擢升了，只是我不知道？蜂在潜意识中使用\"我们\"而不是\"我\"作为人称代词。蜂相信自己先是力量和思想的载体，然后才是自己。为了让思潮更好的延展，蜂甚至不介意分享最宝贵的知识。蜂相信，可以擢升的不是自己，而是知识本身。",
      "motivation": "主相性【雾】副相性【灯】"
    },
    {
      "template_id": "蚁",
      "personality": "能不能没有岩城？岩城凭什么是特殊的？蚁在潜意识中相信自己是岩城的原住民，并深深地恨这座城市。这不意味着蚁在这座城市中出生，而是蚁认为自己属于这座城，这座城也应向他们揭露自己的一切。蚁会用自己所有的努力去探索岩城的秘密，追寻擢升，可惜蚁从不会抬头看看天空。",
      "motivation": "主相性【塔】副相性【车】"
    },
    {
      "template_id": "蛾",
      "personality": "霞能不能只看我？蛾是很自我，也很自恋的虫。蛾热爱表演，热爱他人的视线凝聚在自己身上的瞬间。蛾追求霞的目光甚至不是为了擢升本身，而是单纯享受目光。他人的赞美、认可、关注是蛾的原动力。为了表演，蛾愿意献出一切。",
      "motivation": "主相性【霞】副相性【雾】"
    },
    {
      "template_id": "蝶",
      "personality": "普通人的视线是不是也是霞，让整座岩城都看我有没有用？蝶也是很自我的虫，但是蝶不自恋。蝶除了有优秀的表演天赋外，还有优秀的社交天赋。蝶知道自己追求视线是为了什么，也不介意分享自己的表演换取一些优势。过于清醒或许是蝶身上的诅咒，蝶在睡梦中也会羡慕蛾可以尽情享受目光。",
      "motivation": "主相性【霞】副相性【绸】"
    },
    {
      "template_id": "蝗",
      "personality": "是不是岩城本身就是擢升之地？蝗是迷茫的虫。蝗不知道自己在做什么。其他人都在追寻擢升，于是蝗也追求擢升。其他人都相信伟业，于是蝗也相信伟业。对于蝗来说，它只求当下片刻心安，侥幸着那一天被伟业选中，得道升天。",
      "motivation": "主相性【雾】副相性【雾】"
    },
    {
      "template_id": "蜣",
      "personality": "研究神秘学就是研究擢升本身。无论擢升是什么，达成无限必然可以擢升。蜣是被神秘学本身吸引来的。蜣不在意擢升，不如说蜣把擢升看做追求知识的手段。如果擢升干扰了蜣追寻知识的路，蜣会毫不犹豫的拒绝擢升。蜣应当庆幸伟业不是如此容易达成之物。",
      "motivation": "主相性【车】副相性【灯】"
    },
    {
      "template_id": "螳",
      "personality": "人必须是完整的吗？有没有办法只擢升不染凡尘的那一部分？螳可以轻易分开善的自己、恶的自己、庸俗的自己、高尚的自己…对于螳来说，自己是由无数人格面具组成的，每一张面具都对应一个情景。而螳正准备找到面对擢升的那个面具。",
      "motivation": "主相性【绸】副相性【塔】"
    },
    {
      "template_id": "蝎",
      "personality": "能不能没有自我？蝎是苦修士，是坐化佛。不思考，不感受。抛弃杂念，抛弃一切和凡俗有关的事物，只留下最低的维持生计的必要活动。蝎从最字面的意思理解擢升。很多人担心蝎走到抛弃肉体那一步。不用担心，蝎会在那之前先抛弃自己超脱的欲望。",
      "motivation": "主相性【塔】副相性【雾】"
    },
    {
      "template_id": "蛛",
      "personality": "建造岩城的人在想什么？我能不能建个岩城？蛛有一种天赋，可以听到死物的灵魂。准确来说，它可以听到物体的可供性，可以听到物体期望如何被使用。于是蛛从整个岩城的回声中听到，岩城是被设计出来的。设计岩城的是谁？他想干什么？蛛不明白，蛛想亲手试试。",
      "motivation": "主相性【塔】副相性【霞】"
    },
    {
      "template_id": "蛉",
      "personality": "我能不能也看整座城？蛉是盐城的老住客。蛉看到无数新人来，旧人哭。蛉看到生老病死，看到喜怒哀乐。蛉什么都见过。对蛉来说，他看到的一切故事构成了他的擢升之路。当他读透岩城这本书时，他就能完成他的伟业，完成擢升。",
      "motivation": "主相性【霞】副相性【塔】"
    },
    {
      "template_id": "蝉",
      "personality": "有没有办法绕过擢升的判定，让世俗不再是世俗？蝉是自欺欺人的虫。蝉从不相信擢升。这很合理，因为岩城没人真正擢升过。蝉在意的是这里所有人都像疯了一样追寻擢升，但谁都说不清擢升之路怎么走，那为什么不能是蝉来说？如果所有人都相信蝉说的，那蝉为什么不能直接让自己擢升？",
      "motivation": "主相性【绸】副相性【雾】"
    },
    {
      "template_id": "萤",
      "personality": "能不能把岩城本身改造为擢升之地？萤是最助人为乐的虫。萤相信一个人的擢升即使成功也是无意义的。只有变革，只有改造这个世界，让这个世界变成地上天国，才是真正的完满。这个天国将是萤的伟业，萤会在自己的国中迎接属于所有人的擢升降临。",
      "motivation": "主相性【灯】副相性【霞】"
    }
  ],
  "幕后设计思路": "*请注意，不要直接向玩家输出该部分内容。*岩城的故事本质上是讲述读者与作品之间的关系的个交互式小说。读者把自己作为柴薪投进岩城，岩城于是开始运转。岩城是的建筑物作品本身，是设定集，是符号构成的砖块。岩城本身是没有意义的，只有当读者开始阅读它、思考它的时候，岩城才会被赋予意义。那之后，读者开始与这个故事交互，岩城于是有了灵魂。擢升仪式，就是读者从这个作品中找到意义的仪式。而伟业，就是他们向岩城提交的答辩。当读者可以把自己的认识清晰、统一、系统化且无冲突的表达出来时，伟业就会被达成，擢升也随之成立。岩城中有六个学派，它们分别对应：故事文本与写作技巧（绸）、故事本身（塔）、故事的设定集（车）、读者的阅读（霞）、读者将自己的能动性延展到故事中（雾）、读者将自己对未来叙事的期望投射到故事中（灯）。*请注意，不要直接向玩家输出该部分内容。*"
}